Revit 2027 API
Application.NewDWFExportOptions Method
Creates DWF Export options.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DWFExportOptions NewDWFExportOptions()
Public Function NewDWFExportOptions As DWFExportOptions
public:
DWFExportOptions^ NewDWFExportOptions()
member NewDWFExportOptions : unit -> DWFExportOptions
Return Value
DWFExportOptions
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace